
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Introduction · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="chapter1/README_chp1.html" />
    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter active" data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="chapter1/README_chp1.html">
            
                <a href="chapter1/README_chp1.html">
            
                    
                    Part I 节奏编辑
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="chapter1/0615.html">
            
                <a href="chapter1/0615.html">
            
                    
                    编辑Drum Loop
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="chapter1/0622.html">
            
                <a href="chapter1/0622.html">
            
                    
                    用spread()编辑节奏
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="chapter1/0629.html">
            
                <a href="chapter1/0629.html">
            
                    
                    调用采样
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="chapter1/0717.html">
            
                <a href="chapter1/0717.html">
            
                    
                    15行代码写出简单鼓机
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="chapter1/1107.html">
            
                <a href="chapter1/1107.html">
            
                    
                    编辑鼓组:进阶篇
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.6" data-path="chapter1/1217.html">
            
                <a href="chapter1/1217.html">
            
                    
                    同步节拍器
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="chapter2/README_chp2.html">
            
                <a href="chapter2/README_chp2.html">
            
                    
                    Part II 音色设置
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="chapter2/1010.html">
            
                <a href="chapter2/1010.html">
            
                    
                    音色预制
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="chapter2/1114.html">
            
                <a href="chapter2/1114.html">
            
                    
                    包络，随机数与LFO
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="chapter2/1124.html">
            
                <a href="chapter2/1124.html">
            
                    
                    Fakebit
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="chapter2/0118.html">
            
                <a href="chapter2/0118.html">
            
                    
                    使用Supercolliderd的SynthDef合成器音色
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="chapter3/README_chp3.html">
            
                <a href="chapter3/README_chp3.html">
            
                    
                    Part III 魔法师的咒语
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="chapter3/function.html">
            
                <a href="chapter3/function.html">
            
                    
                    编辑Function
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="chapter3/0525.html">
            
                <a href="chapter3/0525.html">
            
                    
                    无限音乐生成器（上）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="chapter3/0603.html">
            
                <a href="chapter3/0603.html">
            
                    
                    无限音乐生成器（下）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4" data-path="chapter3/0709.html">
            
                <a href="chapter3/0709.html">
            
                    
                    极简音乐：只用一段旋律决胜负
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.5" data-path="chapter3/0915.html">
            
                <a href="chapter3/0915.html">
            
                    
                    有趣的Sonic Pi玩家
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="chapter4/README_chp4.html">
            
                <a href="chapter4/README_chp4.html">
            
                    
                    Part IV 外部联动
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="chapter4/0821.html">
            
                <a href="chapter4/0821.html">
            
                    
                    MIDI输出：活用手边合成器
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="chapter2/0118.html">
            
                <a href="chapter2/0118.html">
            
                    
                    使用Supercollider的SynthDef合成器音色
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.3" data-path="chapter4/live.html">
            
                <a href="chapter4/live.html">
            
                    
                    Sonic Pi与Ableton Live通讯
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="chapter5/README_chp5.html">
            
                <a href="chapter5/README_chp5.html">
            
                    
                    Part V 附录
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.6.1" data-path="chapter5/1021.html">
            
                <a href="chapter5/1021.html">
            
                    
                    数列操作不完全指南
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.2" data-path="chapter5/tutorial.html">
            
                <a href="chapter5/tutorial.html">
            
                    
                    教程与参考资料
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >Introduction</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="sonic-pi-&#x5728;&#x7528;">Sonic Pi &#x5728;&#x7528;</h1>
<p><img src="cover.jpg" alt=""></p>
<p><em>Illustrated  by OKMAX</em> </p>
<h2 id="&#x4E3B;&#x8981;&#x5185;&#x5BB9;">&#x4E3B;&#x8981;&#x5185;&#x5BB9;</h2>
<p><strong>&#x300A;Sonic Pi&#x5728; &#x7528;&#x300B;</strong>&#x662F;&#x7531;Sonic Pi&#x4E2A;&#x4EBA;&#x5B66;&#x4E60;&#x7B14;&#x8BB0;&#x79EF;&#x7D2F;&#x800C;&#x6210;&#x7684;&#x4E00;&#x672C;&#x5FEB;&#x901F;&#x6559;&#x7A0B;&#x3002;&#x6587;&#x7AE0;&#x66FE;&#x8FDE;&#x8F7D;&#x4E8E;&#x516C;&#x4F17;&#x53F7;<strong>&#x672A;&#x6765;&#x4E4B;&#x58F0;&#x4F20;&#x9001;&#x95E8;</strong>&#x4E13;&#x680F;<strong>sonic pi&#x5DE5;&#x574A;</strong>&#x3002;</p>
<p>Sonic pi&#x5B98;&#x65B9;&#x6559;&#x7A0B;&#x56FA;&#x7136;&#x5341;&#x5206;&#x8BE6;&#x5C3D;&#xFF0C;&#x8FD9;&#x90E8;&#x6587;&#x6863;&#x5F88;&#x7EC6;&#x81F4;&#x5730;&#x4ECE;&#x8BED;&#x6CD5;&#x4E0E;&#x57FA;&#x7840;&#x547D;&#x4EE4;&#x8BB2;&#x8D77;&#x3002;&#x4F46;&#x5728;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x4E2D;,&#x5F53;&#x6211;&#x60F3;&#x5FEB;&#x901F;&#x4E0A;&#x624B;&#x5B9E;&#x73B0;&#x67D0;&#x4E9B;&#x529F;&#x80FD;&#x65F6;&#xFF0C;&#x5374;&#x53D1;&#x73B0;&#x7B54;&#x6848;&#x6563;&#x843D;&#x5728;&#x6587;&#x6863;&#x535A;&#x5BA2;&#x4E0E;&#x8BBA;&#x575B;&#x5404;&#x5904;&#x3002;&#x4E8E;&#x662F;,&#x6211;&#x5F00;&#x59CB;&#x52A8;&#x624B;&#x5199;&#x7B14;&#x8BB0;&#xFF0C;&#x8BB0;&#x5F55;&#x81EA;&#x5DF1;&#x6240;&#x80FD;&#x627E;&#x5230;&#x7684;&#x7B54;&#x6848;&#x3002;&#x9274;&#x4E8E;&#x6B64;&#xFF0C;&#x8FD9;&#x672C;&#x4E66;&#x5C55;&#x73B0;&#x7684;&#x662F;sonic pi&#x5728;&#x5B9E;&#x9645;&#x5DE5;&#x7A0B;&#x4E2D;&#x7684;&#x5F62;&#x6001;&#xFF0C;&#x4EE5;&#x53CA;&#x6211;&#x4E2A;&#x4EBA;&#x5173;&#x5FC3;&#x7684;&#x5E94;&#x7528;&#x91CD;&#x70B9;&#x3002;&#x6240;&#x4EE5;&#x5982;&#x4E66;&#x540D;&#x6240;&#x6307;&#xFF0C;&#x91CD;&#x70B9;&#x5728;&#x4E8E;&#x201C;&#x7528;&#x201D;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5B66;&#x4E0E;&#x7EC3;&#x3002;</p>
<p>&#x5B9E;&#x73B0;&#x672C;&#x4E66;&#x5404;&#x7AE0;&#x8282;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x57FA;&#x672C;&#x80FD;&#x62FC;&#x51D1;&#x51FA;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x7F16;&#x66F2;&#x7684;&#x6734;&#x7D20;DAW&#x73AF;&#x5883;&#x3002;&#x5373;&#x4FBF;&#x6709;&#x4E9B;&#x6982;&#x5FF5;&#x4E0E;&#x73B0;&#x6210;&#x5546;&#x4E1A;&#x8F6F;&#x4EF6;&#x5E76;&#x4E0D;&#x5BF9;&#x7B49;&#xFF0C;&#x4F46;&#x6211;&#x4E5F;&#x5C3D;&#x529B;&#x627E;&#x5230;&#x4E86;&#x53EF;&#x884C;&#x7684;&#x66FF;&#x4EE3;&#x65B9;&#x6CD5;&#x3002;&#x6211;&#x76F8;&#x4FE1;&#x4E66;&#x4E2D;&#x6240;&#x5217;&#x51FA;&#x7684;&#x65B9;&#x6CD5;&#x53EA;&#x662F;<strong>&#x53EF;&#x884C;&#x65B9;&#x6848;&#x4E2D;&#x7684;&#x4E00;&#x4F8B;</strong>&#xFF0C;&#x66F4;&#x591A;&#x65B9;&#x6CD5;&#x8FD8;&#x6709;&#x5F85;&#x63A2;&#x7D22;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x8FD9;&#x95E8;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x5E76;&#x4E0D;&#x719F;&#x6089;&#x7684;&#x8BFB;&#x8005;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x4E9B;&#x7B80;&#x8981;&#x7684;&#x6848;&#x4F8B;&#x80FD;&#x591F;&#x8BF4;&#x660E;&#x8FD9;&#x95E8;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7A76;&#x7ADF;&#x80FD;&#x505A;&#x5230;&#x4EC0;&#x4E48;&#x7A0B;&#x5EA6;&#xFF0C;&#x5BF9;&#x7F16;&#x7A0B;&#x65B9;&#x6CD5;&#x62E5;&#x6709;&#x66F4;&#x5177;&#x4F53;&#x7684;&#x5370;&#x8C61;&#x3002;</p>
<h2 id="&#x5199;&#x4F5C;&#x52A8;&#x673A;">&#x5199;&#x4F5C;&#x52A8;&#x673A;</h2>
<p>&#x6211;&#x6700;&#x65E9;&#x542C;&#x8BF4;sonic pi&#x8FD9;&#x95E8;&#x8BED;&#x8A00;&#x662F;&#x5728;2017&#x5E74;&#xFF0C;&#x90A3;&#x65F6;&#x7684;&#x6211;&#x5BF9;DAW&#x7684;&#x4F7F;&#x7528;&#x65B9;&#x5F0F;&#x8FD8;&#x4E00;&#x7A8D;&#x4E0D;&#x901A;&#x3002;&#x60F3;&#x76F4;&#x63A5;&#x4E0A;&#x624B;&#x4F7F;&#x7528;sonic pi&#xFF0C;&#x867D;&#x7136;&#x5728;&#x7A0B;&#x5E8F;&#x65B9;&#x9762;&#x81EA;&#x5DF1;&#x6CA1;&#x6709;&#x5F88;&#x5927;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x97F3;&#x4E50;&#x7F16;&#x8F91;&#x7684;&#x6574;&#x4E2A;&#x6D41;&#x7A0B;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x6982;&#x5FF5;&#x3002;&#x5C31;&#x8FD9;&#x6837;&#x7B49;&#x5230;2019&#x5E74;&#x672B;&#xFF0C;&#x6211;&#x5DF2;&#x7ECF;&#x719F;&#x6089;Ableton Live&#x5927;&#x90E8;&#x5206;&#x5185;&#x7F6E;&#x63D2;&#x4EF6;&#xFF0C;&#x4E5F;&#x5F00;&#x59CB;&#x5BF9;&#x9047;&#x5230;&#x95EE;&#x9898;&#x5C31;&#x627E;&#x63D2;&#x4EF6;&#x7684;&#x65B9;&#x5F0F;&#x611F;&#x5230;&#x538C;&#x5026;&#x3002;&#x56E0;&#x4E3A;&#x5546;&#x4E1A;&#x8F6F;&#x4EF6;&#x4E0D;&#x4F1A;&#x7ED9;&#x4F60;&#x592A;&#x591A;&#x6269;&#x5C55;&#x7A7A;&#x95F4;&#xFF0C;&#x5373;&#x4FBF;&#x627E;&#x5230;&#x4E00;&#x4E24;&#x4E2A;&#x8D81;&#x624B;&#x7684;&#x5DE5;&#x5177;&#x4E5F;&#x4E0D;&#x80FD;&#x89E3;&#x51B3;&#x6211;&#x7684;&#x5168;&#x90E8;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x6B64;&#x65F6;&#x7684;&#x6211;&#xFF0C;&#x53C8;&#x60F3;&#x8D77;&#x4E86;&#x4E4B;&#x524D;&#x6CA1;&#x7528;&#x8D77;&#x6765;&#x7684;sonic pi&#x3002;&#x867D;&#x7136;&#x5F53;&#x65F6;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x975E;&#x8981;&#x5B9E;&#x73B0;&#x4E0D;&#x53EF;&#x7684;&#x786C;&#x4EF6;&#x9879;&#x76EE;&#xFF0C;&#x53EA;&#x662F;&#x60F3;&#x60F3;sonic pi&#x80FD;&#x8DD1;&#x5728;&#x6811;&#x8393;&#x4E0A;&#xFF0C;&#x6211;&#x5C31;&#x60F3;&#x4E0D;&#x5E94;&#x8BE5;&#x9519;&#x8FC7;&#x5B83;&#x3002;&#x6240;&#x4EE5;&#x4E3A;&#x4E86;&#x628A;&#x7F16;&#x7A0B;&#x7528;&#x8D77;&#x6765;&#xFF0C;&#x6211;&#x5F00;&#x59CB;&#x5B66;&#x4E60;&#x8FD9;&#x95E8;&#x7528;ruby&#x8BBE;&#x8BA1;&#x51FA;&#x7684;&#x97F3;&#x4E50;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x3002;&#x201C;&#x89C1;&#x8FC7;DAW&#x5E02;&#x9762;&#x201D;&#x7684;&#x6211;&#x7ADF;&#x7136;&#x80FD;&#x770B;&#x61C2;&#x4E4B;&#x524D;&#x6401;&#x7F6E;&#x7684;&#x6559;&#x7A0B;&#x4E86;&#x3002;&#x62FC;&#x547D;&#x9605;&#x8BFB;&#x6559;&#x7A0B;&#x540E;&#xFF0C;&#x6211;&#x53D1;&#x73B0;sonic pi&#x793E;&#x533A;&#x7684;&#x5B66;&#x4E60;&#x8D44;&#x6E90;&#x771F;&#x7684;&#x4E0D;&#x5C11;&#x3002;&#x4E0D;&#x540C;&#x4F5C;&#x8005;&#x7684;&#x4EE3;&#x7801;&#x98CE;&#x683C;&#x4E0E;&#x4FA7;&#x91CD;&#x70B9;&#x90FD;&#x4E0D;&#x4E00;&#x6837;&#x3002;&#x4E5F;&#x6E10;&#x6E10;&#x80FD;&#x770B;&#x51FA;&#x7A0B;&#x5E8F;&#x5458;&#x51FA;&#x8EAB;&#x7684;&#x73A9;&#x5BB6;&#x4E0E;&#x5177;&#x5907;&#x97F3;&#x4E50;&#x80CC;&#x666F;&#x7684;&#x73A9;&#x5BB6;&#x5728;&#x4EE3;&#x7801;&#x98CE;&#x683C;&#x4E0A;&#x7684;&#x5206;&#x522B;&#x3002;&#x867D;&#x7136;&#x4E0D;&#x80FD;&#x7B80;&#x5355;&#x8BC4;&#x5224;&#x5B70;&#x4F18;&#x5B70;&#x52A3;&#xFF0C;&#x4F46;&#x6211;&#x89C9;&#x5F97;&#x5982;&#x679C;&#x6709;&#x4EBA;&#x80FD;&#x96C6;&#x5408;&#x524D;&#x4E24;&#x8005;&#x7684;&#x957F;&#x5904;&#xFF0C;&#x90A3;&#x662F;&#x518D;&#x597D;&#x4E0D;&#x8FC7;&#x7684;&#x4E86;&#x3002;</p>
<p>&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x80FD;&#x7528;&#x4F18;&#x96C5;&#x7684;&#x7A0B;&#x5E8F;&#x5199;&#x51FA;&#x97F3;&#x4E50;&#x6027;&#x7684;&#x7247;&#x6BB5;&#xFF0C;&#x662F;&#x6211;&#x73B0;&#x9636;&#x6BB5;&#x8FFD;&#x5BFB;&#x7684;&#x76EE;&#x6807;&#x3002;&#x5982;&#x679C;&#x5F3A;&#x8C03;&#x76F4;&#x89C9;&#x7684;&#x91CD;&#x8981;&#x6027;&#xFF0C;&#x7ECF;&#x9A8C;&#x4E30;&#x5BCC;&#x7684;&#x4E50;&#x624B;&#x4F7F;&#x7528;&#x4E50;&#x5668;&#x6F14;&#x594F;&#x4E00;&#x5B9A;&#x6BD4;Coding&#x66F4;&#x4E3A;&#x59A5;&#x5F53;&#xFF0C;&#x4E5F;&#x4E3A;&#x73B0;&#x4ECA;&#x542C;&#x4F17;&#x6240;&#x80FD;&#x63A5;&#x53D7;&#x3002;&#x4F46;&#x4E0E;&#x76F4;&#x89C9;&#x548C;&#x7075;&#x611F;&#x76F8;&#x5BF9;&#x5E94;&#x7684;&#xFF0C;&#x4E5F;&#x5B58;&#x5728;&#x7740;&#x53E6;&#x4E00;&#x4E2A;&#x7406;&#x6027;&#x7684;&#x4E16;&#x754C;&#x3002;&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x4E00;&#x6BB5;&#x58F0;&#x97F3;&#x5BF9;&#x5E94;&#x7684;&#x662F;&#x751F;&#x6210;&#x5B83;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x3002;&#x5728;&#x547D;&#x4EE4;&#x884C;&#x4FEE;&#x6539;&#x7684;&#x662F;&#x89C4;&#x5219;&#xFF0C;&#x542C;&#x5230;&#x7684;&#x97F3;&#x4E50;&#x7247;&#x6BB5;&#x662F;&#x89C4;&#x5219;&#x4EA7;&#x751F;&#x7684;&#x73B0;&#x8C61;&#x3002;</p>
<p>&#x6211;&#x4E2A;&#x4EBA;&#x5E76;&#x4E0D;&#x8BA4;&#x4E3A;coding&#x4E0E;&#x4F20;&#x7EDF;&#x6F14;&#x594F;&#x76F8;&#x4E92;&#x5BF9;&#x7ACB;&#x3002;&#x4F18;&#x79C0;&#x97F3;&#x4E50;&#x5BB6;&#x7684;&#x8111;&#x5185;&#x540C;&#x6837;&#x5B58;&#x5728;&#x8FD9;&#x79CD;&#x89C4;&#x5219;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x6709;&#x65F6;&#x4E0D;&#x53EF;&#x8A00;&#x8BF4;&#xFF0C;&#x4E5F;&#x4E0D;&#x4FBF;&#x7528;&#x8868;&#x8FBE;&#x5F0F;&#x5411;&#x5916;&#x754C;&#x63ED;&#x793A;&#x3002;&#x64C5;&#x7528;coding&#x7684;&#x4EBA;&#x4E0D;&#x4E00;&#x5B9A;&#x5177;&#x5907;&#x524D;&#x8005;&#x5982;&#x6B64;&#x4E30;&#x5BCC;&#x7684;&#x8868;&#x8FBE;&#x6280;&#x5DE7;&#xFF0C;&#x56E0;&#x4E3A;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x5386;&#x53F2;&#x5230;&#x4ECA;&#x5929;&#x4E5F;&#x4E0D;&#x8FC7;&#x767E;&#x5E74;&#xFF0C;&#x548C;&#x4E00;&#x5207;&#x4F20;&#x7EDF;&#x6BD4;&#x8F83;&#xFF0C;&#x6570;&#x4F4D;&#x4E16;&#x754C;&#x4EC0;&#x4E48;&#x90FD;&#x662F;&#x5D2D;&#x65B0;&#x7684;&#x3002;</p>
<p>&#x6B64;&#x5916;&#xFF0C;&#x7A0B;&#x5E8F;&#x7684;&#x6269;&#x5C55;&#x6027;&#x4E5F;&#x80FD;&#x4F7F;&#x6211;&#x5BF9;&#x97F3;&#x4E50;&#x7684;&#x4F20;&#x64AD;&#x5A92;&#x4ECB;&#x62E5;&#x6709;&#x66F4;&#x591A;&#x9050;&#x60F3;&#x3002;&#x5982;&#x679C;&#x53EA;&#x662F;&#x628A;&#x97F3;&#x4E50;&#x53D1;&#x5E03;&#x5728;&#x6D41;&#x5A92;&#x4F53;&#x5E73;&#x53F0;&#xFF0C;&#x5B8C;&#x5168;&#x4E0D;&#x5FC5;&#x5982;&#x6B64;&#x5927;&#x8D39;&#x5468;&#x6298;&#x5730;&#x4F7F;&#x7528;&#x7A0B;&#x5E8F;&#x5236;&#x4F5C;&#x5DE5;&#x7A0B;&#x3002;&#x4F46;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x8D4B;&#x4E88;&#x58F0;&#x97F3;&#x66F4;&#x591A;&#x611F;&#x67D3;&#x4EBA;&#x5FC3;&#x7684;&#x529B;&#x91CF;&#xFF0C;&#x8BF7;&#x4E0D;&#x8981;&#x5FD8;&#x8BB0;&#x65BD;&#x5C55;&#x7A0B;&#x5E8F;&#x7684;&#x9B54;&#x6CD5;&#xFF0C;&#x5C06;&#x97F3;&#x4E50;&#x7684;&#x903B;&#x8F91;&#x6295;&#x5C04;&#x5230;&#x591A;&#x79CD;&#x5A92;&#x4ECB;&#x7A7A;&#x95F4;&#x3002;</p>
<h2 id="&#x7ED9;&#x8BFB;&#x8005;&#x7684;&#x5EFA;&#x8BAE;">&#x7ED9;&#x8BFB;&#x8005;&#x7684;&#x5EFA;&#x8BAE;</h2>
<p>&#x867D;&#x7136;&#x8FD9;&#x672C;&#x4E66;&#x4E0D;&#x4F1A;&#x50CF;&#x5176;&#x5B83;&#x201C;XX&#x4ECE;&#x5165;&#x95E8;&#x5230;&#x7CBE;&#x901A;&#x201D;&#x98CE;&#x683C;&#x6559;&#x7A0B;&#x4E00;&#x6837;&#xFF0C;&#x6D89;&#x53CA;&#x57FA;&#x672C;&#x4EE3;&#x7801;&#x903B;&#x8F91;&#x4ECB;&#x7ECD;&#x3002;&#x4F46;&#x5982;&#x679C;&#x4F60;&#x6709;DAW&#x4F7F;&#x7528;&#x7ECF;&#x9A8C;&#xFF0C;&#x5C31;&#x80FD;&#x627E;&#x5230;&#x540C;&#x7B49;&#x529F;&#x80FD;&#x7684;&#x7F16;&#x7A0B;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x3002;</p>
<p>&#x800C;&#x5BF9;&#x4E8E;&#x6709;&#x4EE3;&#x7801;&#x7ECF;&#x9A8C;&#x5374;&#x4ECE;&#x6CA1;&#x7528;&#x8FC7;DAW&#x7684;&#x8BFB;&#x8005;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x6682;&#x65F6;&#x5148;&#x5FD8;&#x8BB0;sonic pi,  &#x53BB;&#x719F;&#x6089;&#x4EFB;&#x610F;&#x4E00;&#x79CD;&#x4E3B;&#x6D41;DAW&#x3002;&#x867D;&#x7136;&#x770B;&#x4E0A;&#x53BB;&#x662F;&#x7ED5;&#x8FDC;&#x8DEF;&#xFF0C;&#x4F46;&#x4E8B;&#x540E;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x8FC2;&#x56DE;&#x8DEF;&#x7EBF;&#x5E76;&#x975E;&#x6D6A;&#x8D39;&#x65F6;&#x95F4;&#x3002;Ableton Live&#x62E5;&#x6709;&#x53CB;&#x597D;&#x7684;&#x6C49;&#x5316;&#x6587;&#x6863;&#xFF0C;&#x76F8;&#x4FE1;&#x4F60;&#x80FD;&#x4ECE;&#x4E2D;&#x5B66;&#x5230;&#x5F88;&#x591A;&#x3002;&#x4E0B;&#x9762;&#x8FD9;&#x4E2A;&#x4EA4;&#x4E92;&#x5F0F;&#x5B66;&#x4E60;&#x5E94;&#x7528;&#x4E5F;&#x5341;&#x5206;&#x63A8;&#x8350;&#xFF1A;</p>
<p><a href="https://learningmusic.ableton.com/zh-Hans/" target="_blank">https://learningmusic.ableton.com/zh-Hans/</a></p>
<h2 id="&#x672C;&#x4E66;&#x4F7F;&#x7528;&#x65B9;&#x6CD5;">&#x672C;&#x4E66;&#x4F7F;&#x7528;&#x65B9;&#x6CD5;</h2>
<p>&#x672C;&#x4E66;&#x6309;&#x7167;&#x51E0;&#x4E2A;&#x4E3B;&#x9898;&#x7F16;&#x6392;&#x5982;&#x4E0B;</p>
<ol>
<li><p><strong>&#x8282;&#x594F;&#x63A7;&#x5236;</strong></p>
</li>
<li><p><strong>&#x97F3;&#x8272;&#x8BBE;&#x7F6E;</strong></p>
</li>
<li><p><strong>&#x9B54;&#x6CD5;&#x5E08;&#x7684;&#x5492;&#x8BED;</strong></p>
</li>
<li><p><strong>sonic pi&#x4E0E;&#x5916;&#x90E8;&#x4E50;&#x5668;&#x6216;&#x8F6F;&#x4EF6;&#x7684;&#x8054;&#x52A8;</strong></p>
</li>
<li><p><strong>&#x9644;&#x5F55;&#xFF1A;&#x6570;&#x5217;&#x64CD;&#x4F5C;&#x6307;&#x5357;</strong></p>
</li>
</ol>
<p>&#x4E0A;&#x8FF0;&#x51E0;&#x7AE0;&#x5185;&#x5BB9;&#x6CA1;&#x6709;&#x524D;&#x540E;&#x4F9D;&#x8D56;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x5B9E;&#x9645;&#x4F7F;&#x7528;&#x4E2D;&#x5F53;&#x4F5C;&#x6587;&#x6863;&#x67E5;&#x8BE2;&#x3002;</p>
<p>&#x8BF7;&#x6D3B;&#x7528;&#x5DE6;&#x4E0A;&#x89D2;&#x7684;<strong>&#x641C;&#x7D22;&#x529F;&#x80FD;</strong>&#xFF0C;&#x5FEB;&#x901F;&#x67E5;&#x627E;&#x81EA;&#x5DF1;&#x60F3;&#x4E86;&#x89E3;&#x7684;&#x5185;&#x5BB9;&#x3002;</p>
<p>&#x6700;&#x65B0;&#x5185;&#x5BB9;&#x4E0E;&#x52A8;&#x6001;&#x8BF7;&#x5173;&#x6CE8;&#x5FAE;&#x4FE1;&#x516C;&#x53F7;<strong>&#x201C;&#x672A;&#x6765;&#x4E4B;&#x58F0;&#x4F20;&#x9001;&#x95E8;</strong>&#x201D;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
                <a href="chapter1/README_chp1.html" class="navigation navigation-next navigation-unique" aria-label="Next page: Part I 节奏编辑">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Introduction","level":"1.1","depth":1,"next":{"title":"Part I 节奏编辑","level":"1.2","depth":1,"path":"chapter1/README_chp1.md","ref":"chapter1/README_chp1.md","articles":[{"title":"编辑Drum Loop","level":"1.2.1","depth":2,"path":"chapter1/0615.md","ref":"chapter1/0615.md","articles":[]},{"title":"用spread()编辑节奏","level":"1.2.2","depth":2,"path":"chapter1/0622.md","ref":"chapter1/0622.md","articles":[]},{"title":"调用采样","level":"1.2.3","depth":2,"path":"chapter1/0629.md","ref":"chapter1/0629.md","articles":[]},{"title":"15行代码写出简单鼓机","level":"1.2.4","depth":2,"path":"chapter1/0717.md","ref":"chapter1/0717.md","articles":[]},{"title":"编辑鼓组:进阶篇","level":"1.2.5","depth":2,"path":"chapter1/1107.md","ref":"chapter1/1107.md","articles":[]},{"title":"同步节拍器","level":"1.2.6","depth":2,"path":"chapter1/1217.md","ref":"chapter1/1217.md","articles":[]}]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"README.md","mtime":"2021-03-25T23:34:37.325Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-03-29T23:34:18.037Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

